Revit 2027 API
ColorBackgroundSettings Class
 Represents the rendering color background settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BackgroundSettings
 Autodesk.Revit.DB.ColorBackgroundSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ColorBackgroundSettings : BackgroundSettings
Public Class ColorBackgroundSettings
	Inherits BackgroundSettings
public ref class ColorBackgroundSettings : public BackgroundSettings
type ColorBackgroundSettings =
    class
        inherit BackgroundSettings
    end
The ColorBackgroundSettings type exposes the following members.
Properties
Name | Description
Color |  The color of the rendering background.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from BackgroundSettings)
Top
Methods
Name | Description
Dispose
(Inherited from BackgroundSettings)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace